玩法 + 白模：
渲染方向+shader+后处理的选择
文件的规范处理
选择合适的设计框架
特效，贴图，模型，音效等大量参考与素材


UI:
贴图：
模型：
GPU优化：1.网格合并2.遮挡剔除3.LOD
CPU优化：
地图设计:
    1.地编
    2.关卡和道具碰撞等设计
    3.灯光氛围设计



音效：
    1.
    2.

震动交互：
    1.对象震动
    2.摄像机震动
    3.手机震动：Handheld.Vibrate()
    4.游戏手柄震动：Input.GetVibration(int controllerIndex)获取当前震动状态   Input.SetVibration(int 控制器索引, float 左马达强度, float 右马达强度)设置震动强度
特定api和sdk支持：
    5.VR震动：
    6.VR手柄震动
    7.switch震动

镜头交互:
    各种运镜

时间交互;
    1.时间倍缩与暂停
    2.

动画:



AI+运动+动画系统
按键自定义
存档系统
换色系统
时间系统
mod支持：
内购系统：
对象池
单例模式
背包系统
战斗系统
生存系统



多人联机：
联机存档